harviswang/linux-3.10.99/arch/mips/m200/driverlib/tcu.c
//*****************************************************************************
//
// tcu.c - Driver for the TCU.
//
// Copyright (c) 2017 Harvis Wang.  All rights reserved.
// Software License Agreement
//
//   Redistribution and use in source and binary forms, with or without
//   modification, are permitted provided that the following conditions
//   are met:
//
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
//
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the
//   distribution.
//
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

#include "../inc/hw_tcu.h"
#include "../inc/hw_intc.h"
#include "../inc/hw_memmap.h"
#include "../inc/hw_types.h"
#include "./intc.h"
#include "debug.h"
#include "tcu.h"

//*****************************************************************************
//
// A mapping of TCU base address to interupt number.
//
//*****************************************************************************
static const unsigned long g_ppulTCUIntMap[][2] =
{
    { TCU_TIMER0, IRQ_NO_TCU2 },
    { TCU_TIMER1, IRQ_NO_TCU2 },
    { TCU_TIMER2, IRQ_NO_TCU2 },
    { TCU_TIMER3, IRQ_NO_TCU2 },
    { TCU_TIMER4, IRQ_NO_TCU2 },
    { TCU_TIMER5, IRQ_NO_TCU1 }, // timer5 use indepedent irq
    { TCU_TIMER6, IRQ_NO_TCU2 },
    { TCU_TIMER7, IRQ_NO_TCU2 },
};

//*****************************************************************************
//
//! \internal
//! Checks a TCU base address.
//!
//! \param ulBase is the base address of the TCU.
//!
//! This function determines if a TCU port base address is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static tBoolean
TCUBaseValid(unsigned long ulBase)
{
    return(ulBase == TCU_BASE);
}
#endif

//*****************************************************************************
//
//! \internal
//! Checks a TCU Timer ID valid.
//!
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function determines if a TCU timer ID is valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static tBoolean
TCUTimerIDValid(unsigned long ulTimerID)
{
    return((ulTimerID == TCU_TIMER0) || (ulTimerID == TCU_TIMER1) || 
           (ulTimerID == TCU_TIMER2) || (ulTimerID == TCU_TIMER3) || 
           (ulTimerID == TCU_TIMER4) || (ulTimerID == TCU_TIMER5) || 
           (ulTimerID == TCU_TIMER6) || (ulTimerID == TCU_TIMER7));
}
#endif

//*****************************************************************************
//
//! \internal
//! Checks a TCU Timer ID is TCU1 valid.
//!
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function determines if a TCU timer ID is TCU1 group valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static tBoolean
TCUTimerTCU1Valid(unsigned long ulTimerID)
{
    return((ulTimerID == TCU_TIMER0) || (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER4) || (ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER6) || (ulTimerID == TCU_TIMER7));
}
#endif

//*****************************************************************************
//
//! \internal
//! Checks a TCU Timer ID is TCU2 valid.
//!
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function determines if a TCU timer ID is TCU1 group valid.
//!
//! \return Returns \b true if the base address is valid and \b false
//! otherwise.
//
//*****************************************************************************
#ifdef DEBUG
static tBoolean
TCUTimerTCU2Valid(unsigned long ulTimerID)
{
    return((ulTimerID == TCU_TIMER0) || (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER4) || (ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER6) || (ulTimerID == TCU_TIMER7));
}
#endif
//*****************************************************************************
//
//! Gets the TCU interrupt number.
//!
//! \param ulTimerID is the ID of the TCU timer.
//!
//! Given a TCU Timer ID, this function returns the corresponding
//! interrupt number.
//!
//! \return Returns a TCU interrupt number, or -1 if \e ulTimerID is invalid.
//
//*****************************************************************************
long
TCUIntNumberGet(unsigned long ulTimerID)
{
    unsigned long ulIdx;

    //
    // Loop through the table that maps UART base addresses to interrupt
    // numbers.
    //
    for(ulIdx = 0; ulIdx < (sizeof(g_ppulTCUIntMap) /
                            sizeof(g_ppulTCUIntMap[0])); ulIdx++)
    {
        //
        // See if this base address matches.
        //
        if(g_ppulTCUIntMap[ulIdx][0] == ulTimerID)
        {
            //
            // Return the corresponding interrupt number.
            //
            return(g_ppulTCUIntMap[ulIdx][1]);
        }
    }

    //
    // The base address could not be found, so return an error.
    //
    return(-1);
}

//*****************************************************************************
//
//! Enable a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function enable only one TCU timer, when enabled begin counting up
//!
//! \return Returns true if enable operation success, false others.
//
//*****************************************************************************
tBoolean
TCUCounterEnable(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST7;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN7) == TCU_ER_TCEN7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST6;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN6) == TCU_ER_TCEN6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST5;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN5) == TCU_ER_TCEN5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST4;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN4) == TCU_ER_TCEN4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST3;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN3) == TCU_ER_TCEN3);
    case TCU_TIMER2:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST2;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN2) == TCU_ER_TCEN2);
    case TCU_TIMER1:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST1;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN1) == TCU_ER_TCEN1);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_ESR) |= TCU_ESR_TCST0;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN0) == TCU_ER_TCEN0);
    default:
        ASSERT(false);
        return false;
    }
}

//*****************************************************************************
//
//! Disable a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function disable only one TCU timer, when disabled stop counting up
//!
//! \return Returns true if disable operation success, false others.
//
//*****************************************************************************
tBoolean
TCUCounterDisable(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL7;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN7) != TCU_ER_TCEN7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL6;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN6) != TCU_ER_TCEN6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL5;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN7) != TCU_ER_TCEN7);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL4;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN4) != TCU_ER_TCEN4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL3;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN3) != TCU_ER_TCEN3);
    case TCU_TIMER2:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL2;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN2) != TCU_ER_TCEN2);
    case TCU_TIMER1:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL1;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN1) != TCU_ER_TCEN1);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_ECR) |= TCU_ECR_TCCL0;
        return((HWREGH(ulBase + TCU_O_ER) & TCU_ER_TCEN0) != TCU_ER_TCEN0);
    default:
        ASSERT(false);
        return false;
    }
}

//*****************************************************************************
//
//! Supply clock of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function supply the clock of TCU timer, as a switch on the clock line.
//! it's just a switch, not any clock input source.
//!
//! \return Returns true if disable operation success, false others.
//
//*****************************************************************************
tBoolean
TCUClockSupply(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC7;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP7) != TCU_SR_STOP7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC6;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP6) != TCU_SR_STOP6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC5;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP5) != TCU_SR_STOP5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC4;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP4) != TCU_SR_STOP4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC3;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP3) != TCU_SR_STOP3);
    case TCU_TIMER2:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC2;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP2) != TCU_SR_STOP2);
    case TCU_TIMER1:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC1;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP1) != TCU_SR_STOP1);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_SCR) |= TCU_SCR_STPC0;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP0) != TCU_SR_STOP0);
    default:
        ASSERT(false);
        return false;
    }
}

//*****************************************************************************
//
//! \internal
//! Mask a FIFO empty interrupt of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function mask an FIFO empty interrupt of a TCU timer.
//!
//! \return Returns true if mask operation success, false others.
//
//*****************************************************************************
static tBoolean
TCUInterruptFIFOEmptyMask(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT((ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER0));

    switch (ulTimerID) {
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FIFOEMST5;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOEMASK5) == TCU_MR_FIFOEMASK5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FIFOEMST4;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOEMASK4) == TCU_MR_FIFOEMASK4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FIFOEMST3;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOEMASK3) == TCU_MR_FIFOEMASK3);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FIFOEMST0;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOEMASK0) == TCU_MR_FIFOEMASK0);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Mask a half comparison interrupt of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function mask an half comparison interrupt of a TCU timer.
//!
//! \return Returns true if mask operation success, false others.
//
//*****************************************************************************
static tBoolean
TCUInterruptHalfMask(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_HMST7;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK7) == TCU_MR_HMASK7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_HMST6;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK6) == TCU_MR_HMASK6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_HMST5;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK5) == TCU_MR_HMASK5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_HMST4;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK4) == TCU_MR_HMASK4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_HMST3;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK3) == TCU_MR_HMASK3);
    case TCU_TIMER2:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_HMST2;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK2) == TCU_MR_HMASK2);
    case TCU_TIMER1:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_HMST1;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK1) == TCU_MR_HMASK1);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_HMST0;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_HMASK0) == TCU_MR_HMASK0);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Mask a FIFO interrupt of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function mask an FIFO interrupt of a TCU timer.
//!
//! \return Returns true if mask operation success, false others.
//
//*****************************************************************************
static tBoolean
TCUInterruptFIFOMask(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT((ulTimerID == TCU_TIMER5) ||
           (ulTimerID == TCU_TIMER4) ||
           (ulTimerID == TCU_TIMER3) ||
           (ulTimerID == TCU_TIMER0));

    switch (ulTimerID) {
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FIFOMST5;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOMASK5) == TCU_MR_FIFOMASK5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FIFOMST4;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOMASK4) == TCU_MR_FIFOMASK4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FIFOMST3;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOMASK3) == TCU_MR_FIFOMASK3);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FIFOMST0;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FIFOMASK0) == TCU_MR_FIFOMASK0);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Mask a full comparison interrupt of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function mask an full comparison interrupt of a TCU timer.
//!
//! \return Returns true if mask operation success, false others.
//
//*****************************************************************************
static tBoolean
TCUInterruptFullMask(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FMST7;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK7) == TCU_MR_FMASK7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FMST6;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK6) == TCU_MR_FMASK6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FMST5;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK5) == TCU_MR_FMASK5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FMST4;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK4) == TCU_MR_FMASK4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FMST3;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK3) == TCU_MR_FMASK3);
    case TCU_TIMER2:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FMST2;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK2) == TCU_MR_FMASK2);
    case TCU_TIMER1:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FMST1;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK1) == TCU_MR_FMASK1);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_MSR) |= TCU_MSR_FMST0;
        return((HWREG(ulBase + TCU_O_MR) & TCU_MR_FMASK0) == TCU_MR_FMASK0);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Mask an interrupt of TCU module.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//! \param ulMaskType is the type of TCU interrupt.
//!
//! This function mask an kind interrupt of a TCU timer.
//!
//! \return Returns true if mask operation success, false others.
//
//*****************************************************************************
tBoolean
TCUInterruptMask(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulMaskType)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));
    ASSERT((ulMaskType == TCU_MASKTYPE_FIFOEMPTY) ||
           (ulMaskType == TCU_MASKTYPE_HALF) ||
           (ulMaskType == TCU_MASKTYPE_FIFO) ||
           (ulMaskType == TCU_MASKTYPE_FULL));

