harviswang/linux-3.10.99/arch/mips/m200/driverlib/tcu.c
    switch (ulMaskType) {
    case TCU_MASKTYPE_FIFOEMPTY:
        return(TCUInterruptFIFOEmptyUnmask(ulBase, ulTimerID));
    case TCU_MASKTYPE_HALF:
        return(TCUInterruptHalfUnmask(ulBase, ulTimerID));
    case TCU_MASKTYPE_FIFO:
        return(TCUInterruptFIFOUnmask(ulBase, ulTimerID));
    case TCU_MASKTYPE_FULL:
        return(TCUInterruptFullUnmask(ulBase, ulTimerID));
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Set data full regiser of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//! \param ulDataFull is the value of data full register(just use 16-bit).
//!
//! This function set full register of a TCU timer.
//!
//! \return None.
//
//*****************************************************************************
void
TCUDataFullSet(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulDataFull)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREGH(ulBase + TCU_O_DFR7) = ulDataFull;
        break;
    case TCU_TIMER6:
        HWREGH(ulBase + TCU_O_DFR6) = ulDataFull;
        break;
    case TCU_TIMER5:
        HWREGH(ulBase + TCU_O_DFR5) = ulDataFull;
        break;
    case TCU_TIMER4:
        HWREGH(ulBase + TCU_O_DFR4) = ulDataFull;
        break;
    case TCU_TIMER3:
        HWREGH(ulBase + TCU_O_DFR3) = ulDataFull;
        break;
    case TCU_TIMER2:
        HWREGH(ulBase + TCU_O_DFR2) = ulDataFull;
        break;
    case TCU_TIMER1:
        HWREGH(ulBase + TCU_O_DFR1) = ulDataFull;
        break;
    case TCU_TIMER0:
        HWREGH(ulBase + TCU_O_DFR0) = ulDataFull;
        break;
    default:
        ASSERT(false);
        break;
    }
}

//*****************************************************************************
//
//! Set data half regiser of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//! \param ulDataFull is the value of data half register(just use 16-bit).
//!
//! This function set half register of a TCU timer.
//!
//! \return None.
//
//*****************************************************************************
void
TCUDataHalfSet(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulDataHalf)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREGH(ulBase + TCU_O_DHR7) = ulDataHalf;
        break;
    case TCU_TIMER6:
        HWREGH(ulBase + TCU_O_DHR6) = ulDataHalf;
        break;
    case TCU_TIMER5:
        HWREGH(ulBase + TCU_O_DHR5) = ulDataHalf;
        break;
    case TCU_TIMER4:
        HWREGH(ulBase + TCU_O_DHR4) = ulDataHalf;
        break;
    case TCU_TIMER3:
        HWREGH(ulBase + TCU_O_DHR3) = ulDataHalf;
        break;
    case TCU_TIMER2:
        HWREGH(ulBase + TCU_O_DHR2) = ulDataHalf;
        break;
    case TCU_TIMER1:
        HWREGH(ulBase + TCU_O_DHR1) = ulDataHalf;
        break;
    case TCU_TIMER0:
        HWREGH(ulBase + TCU_O_DHR0) = ulDataHalf;
        break;
    default:
        ASSERT(false);
        break;
    }
}

//*****************************************************************************
//
//! Not supply(Stop) clock of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function stop the clock supply for a TCU timer.
//!
//! \return Returns true if disable operation success, false others.
//
//*****************************************************************************
tBoolean
TCUClockNotSupply(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS7;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP7) == TCU_SR_STOP7);
    case TCU_TIMER6:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS6;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP6) == TCU_SR_STOP6);
    case TCU_TIMER5:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS5;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP5) == TCU_SR_STOP5);
    case TCU_TIMER4:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS4;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP4) == TCU_SR_STOP4);
    case TCU_TIMER3:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS3;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP3) == TCU_SR_STOP3);
    case TCU_TIMER2:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS2;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP2) == TCU_SR_STOP2);
    case TCU_TIMER1:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS1;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP1) == TCU_SR_STOP1);
    case TCU_TIMER0:
        HWREG(ulBase + TCU_O_SSR) |= TCU_SSR_STPS0;
        return((HWREG(ulBase + TCU_O_SR) & TCU_SR_STOP0) == TCU_SR_STOP0);
    default:
        ASSERT(false);
        return false;
    }
}

//*****************************************************************************
//
//! Set the 16-bit counter of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function set the counter of a TCU timer.
//!
//! \return None.
//
//*****************************************************************************
void
TCUCounterSet(unsigned long ulBase, unsigned long ulTimerID, unsigned long ulCounter)
{
    //
    // Check the arguments.
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREGH(ulBase + TCU_O_CNT7) = ulCounter;
        break;
    case TCU_TIMER6:
        HWREGH(ulBase + TCU_O_CNT6) = ulCounter;
        break;
    case TCU_TIMER5:
        HWREGH(ulBase + TCU_O_CNT5) = ulCounter;
        break;
    case TCU_TIMER4:
        HWREGH(ulBase + TCU_O_CNT4) = ulCounter;
        break;
    case TCU_TIMER3:
        HWREGH(ulBase + TCU_O_CNT3) = ulCounter;
        break;
    case TCU_TIMER2:
        HWREGH(ulBase + TCU_O_CNT2) = ulCounter;
        break;
    case TCU_TIMER1:
        HWREGH(ulBase + TCU_O_CNT1) = ulCounter;
        break;
    case TCU_TIMER0:
        HWREGH(ulBase + TCU_O_CNT0) = ulCounter;
        break;
    default:
        ASSERT(false);
        break;
    }
}

//*****************************************************************************
//
//! Shut down(Graceful mode) PWM output of a TCU1 timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function using graceful mode to shut down PWM output of a TCU1 timer.
//!
//! \return Returns true if shutdown operation success, false others.
//
//*****************************************************************************
static tBoolean
TCUPWMShutdownGraceful(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check parameters
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerTCU1Valid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREGH(ulBase + TCU_O_CSR7) &= ~TCU_CSR7_SD;
        return((HWREGH(ulBase + TCU_O_CSR7) & TCU_CSR7_SD) != TCU_CSR7_SD);
    case TCU_TIMER6:
        HWREGH(ulBase + TCU_O_CSR6) &= ~TCU_CSR6_SD;
        return((HWREGH(ulBase + TCU_O_CSR6) & TCU_CSR6_SD) != TCU_CSR6_SD);
    case TCU_TIMER5:
        HWREGH(ulBase + TCU_O_CSR5) &= ~TCU_CSR5_SD;
        return((HWREGH(ulBase + TCU_O_CSR5) & TCU_CSR5_SD) != TCU_CSR5_SD);
    case TCU_TIMER4:
        HWREGH(ulBase + TCU_O_CSR4) &= ~TCU_CSR4_SD;
        return((HWREGH(ulBase + TCU_O_CSR4) & TCU_CSR4_SD) != TCU_CSR4_SD);
    case TCU_TIMER3:
        HWREGH(ulBase + TCU_O_CSR3) &= ~TCU_CSR3_SD;
        return((HWREGH(ulBase + TCU_O_CSR3) & TCU_CSR3_SD) != TCU_CSR3_SD);
    case TCU_TIMER0:
        HWREGH(ulBase + TCU_O_CSR0) &= ~TCU_CSR0_SD;
        return((HWREGH(ulBase + TCU_O_CSR0) & TCU_CSR0_SD) != TCU_CSR0_SD);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Set PWM initial output low level of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function set PWM initial output low level.
//!
//! \return Returns true if shutdown operation success, false others.
//
//*****************************************************************************
static tBoolean
TCUPWMInitialOutputLowLevelSet(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check parameters
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREGH(ulBase + TCU_O_CSR7) &= ~TCU_CSR7_INITL;
        return((HWREGH(ulBase + TCU_O_CSR7) & TCU_CSR7_INITL) != TCU_CSR7_INITL);
    case TCU_TIMER6:
        HWREGH(ulBase + TCU_O_CSR6) &= ~TCU_CSR6_INITL;
        return((HWREGH(ulBase + TCU_O_CSR6) & TCU_CSR6_INITL) != TCU_CSR6_INITL);
    case TCU_TIMER5:
        HWREGH(ulBase + TCU_O_CSR5) &= ~TCU_CSR5_INITL;
        return((HWREGH(ulBase + TCU_O_CSR5) & TCU_CSR5_INITL) != TCU_CSR5_INITL);
    case TCU_TIMER4:
        HWREGH(ulBase + TCU_O_CSR4) &= ~TCU_CSR4_INITL;
        return((HWREGH(ulBase + TCU_O_CSR4) & TCU_CSR4_INITL) != TCU_CSR4_INITL);
    case TCU_TIMER3:
        HWREGH(ulBase + TCU_O_CSR3) &= ~TCU_CSR3_INITL;
        return((HWREGH(ulBase + TCU_O_CSR3) & TCU_CSR3_INITL) != TCU_CSR3_INITL);
    case TCU_TIMER2:
        HWREGH(ulBase + TCU_O_CSR2) &= ~TCU_CSR2_INITL;
        return((HWREGH(ulBase + TCU_O_CSR2) & TCU_CSR2_INITL) != TCU_CSR2_INITL);
    case TCU_TIMER1:
        HWREGH(ulBase + TCU_O_CSR1) &= ~TCU_CSR1_INITL;
        return((HWREGH(ulBase + TCU_O_CSR1) & TCU_CSR1_INITL) != TCU_CSR1_INITL);
    case TCU_TIMER0:
        HWREGH(ulBase + TCU_O_CSR0) &= ~TCU_CSR0_INITL;
        return((HWREGH(ulBase + TCU_O_CSR0) & TCU_CSR0_INITL) != TCU_CSR0_INITL);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! \internal
//! Set PWM initial output high level of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function set PWM initial output high level.
//!
//! \return Returns true if shutdown operation success, false others.
//
//*****************************************************************************
static tBoolean
TCUPWMInitialOutputHighLevelSet(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check parameters
    //
    ASSERT(TCUBaseValid(ulBase));
    ASSERT(TCUTimerIDValid(ulTimerID));

    switch (ulTimerID) {
    case TCU_TIMER7:
        HWREGH(ulBase + TCU_O_CSR7) |= TCU_CSR7_INITL;
        return((HWREGH(ulBase + TCU_O_CSR7) & TCU_CSR7_INITL) == TCU_CSR7_INITL);
    case TCU_TIMER6:
        HWREGH(ulBase + TCU_O_CSR6) |= TCU_CSR6_INITL;
        return((HWREGH(ulBase + TCU_O_CSR6) & TCU_CSR6_INITL) == TCU_CSR6_INITL);
    case TCU_TIMER5:
        HWREGH(ulBase + TCU_O_CSR5) |= TCU_CSR5_INITL;
        return((HWREGH(ulBase + TCU_O_CSR5) & TCU_CSR5_INITL) == TCU_CSR5_INITL);
    case TCU_TIMER4:
        HWREGH(ulBase + TCU_O_CSR4) |= TCU_CSR4_INITL;
        return((HWREGH(ulBase + TCU_O_CSR4) & TCU_CSR4_INITL) == TCU_CSR4_INITL);
    case TCU_TIMER3:
        HWREGH(ulBase + TCU_O_CSR3) |= TCU_CSR3_INITL;
        return((HWREGH(ulBase + TCU_O_CSR3) & TCU_CSR3_INITL) == TCU_CSR3_INITL);
    case TCU_TIMER2:
        HWREGH(ulBase + TCU_O_CSR2) |= TCU_CSR2_INITL;
        return((HWREGH(ulBase + TCU_O_CSR2) & TCU_CSR2_INITL) == TCU_CSR2_INITL);
    case TCU_TIMER1:
        HWREGH(ulBase + TCU_O_CSR1) |= TCU_CSR1_INITL;
        return((HWREGH(ulBase + TCU_O_CSR1) & TCU_CSR1_INITL) == TCU_CSR1_INITL);
    case TCU_TIMER0:
        HWREGH(ulBase + TCU_O_CSR0) |= TCU_CSR0_INITL;
        return((HWREGH(ulBase + TCU_O_CSR0) & TCU_CSR0_INITL) == TCU_CSR0_INITL);
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Enable PWM output function of a TCU timer.
//!
//! \param ulBase is the base address of the TCU.
//! \param ulTimerID is the ID of the TCU timer.
//!
//! This function enable PWM output function.
//!
//! \return Returns true if enable PWM operation success, false others.
//
//*****************************************************************************
tBoolean
TCUPWMEnable(unsigned long ulBase, unsigned long ulTimerID)
{
    //
    // Check parameters
    //
    ASSERT(TCUBaseValid(ulBase));

