harviswang/linux-3.10.99/arch/mips/m200/driverlib/tcu.c
    switch (ulFlagType) {
    case TCU_FLAGTYPE_FIFOEMPTY:
        return(TCUComparisonFIFOEmptyMatchFlagClear(ulBase, ulTimerID));
    case TCU_FLAGTYPE_HALF:
        return(TCUComparisonHalfMatchFlagClear(ulBase, ulTimerID));
    case TCU_FLAGTYPE_FIFO:
        return(TCUComparisonFIFOMatchFlagClear(ulBase, ulTimerID));
    case TCU_FLAGTYPE_FULL:
        return(TCUComparisonFullMatchFlagClear(ulBase, ulTimerID));
    default:
        ASSERT(false);
        return(false);
    }
}

//*****************************************************************************
//
//! Print all register value of TCU.
//!
//! \param ulBase is the base address of the TCU.
//! \param print is a function pointer like printf.
//!
//! This function print value of all register in a TCU.
//!
//! \return none
//
//*****************************************************************************
void
TCURegisterDump(unsigned long ulBase, int (*print)(const char *format, ...))
{
    REGH_PRINT(TCU_O_ER, ulBase, print);
    REG_PRINT(TCU_O_SR, ulBase, print);
    REG_PRINT(TCU_O_FR, ulBase, print);
    REG_PRINT(TCU_O_MR, ulBase, print);
    REGH_PRINT(TCU_O_DFR0, ulBase, print);
    REGH_PRINT(TCU_O_DHR0, ulBase, print);
    REGH_PRINT(TCU_O_CNT0, ulBase, print);
    REGH_PRINT(TCU_O_CSR0, ulBase, print);
    REGH_PRINT(TCU_O_DFR1, ulBase, print);
    REGH_PRINT(TCU_O_DHR1, ulBase, print);
    REGH_PRINT(TCU_O_CNT1, ulBase, print);
    REGH_PRINT(TCU_O_CSR1, ulBase, print);
    REGH_PRINT(TCU_O_DFR2, ulBase, print);
    REGH_PRINT(TCU_O_DHR2, ulBase, print);
    REGH_PRINT(TCU_O_CNT2, ulBase, print);
    REGH_PRINT(TCU_O_CSR2, ulBase, print);
    REGH_PRINT(TCU_O_DFR3, ulBase, print);
    REGH_PRINT(TCU_O_DHR3, ulBase, print);
    REGH_PRINT(TCU_O_CNT3, ulBase, print);
    REGH_PRINT(TCU_O_CSR3, ulBase, print);
    REGH_PRINT(TCU_O_DFR4, ulBase, print);
    REGH_PRINT(TCU_O_DHR4, ulBase, print);
    REGH_PRINT(TCU_O_CNT4, ulBase, print);
    REGH_PRINT(TCU_O_CSR4, ulBase, print);
    REGH_PRINT(TCU_O_DFR5, ulBase, print);
    REGH_PRINT(TCU_O_DHR5, ulBase, print);
    REGH_PRINT(TCU_O_CNT5, ulBase, print);
    REGH_PRINT(TCU_O_CSR5, ulBase, print);
    REGH_PRINT(TCU_O_DFR6, ulBase, print);
    REGH_PRINT(TCU_O_DHR6, ulBase, print);
    REGH_PRINT(TCU_O_CNT6, ulBase, print);
    REGH_PRINT(TCU_O_CSR6, ulBase, print);
    REGH_PRINT(TCU_O_DFR7, ulBase, print);
    REGH_PRINT(TCU_O_DHR7, ulBase, print);
    REGH_PRINT(TCU_O_CNT7, ulBase, print);
    REGH_PRINT(TCU_O_CSR7, ulBase, print);
    REG_PRINT(TCU_O_STR, ulBase, print);
    REGH_PRINT(TCU_O_MODE0, ulBase, print);
    REGH_PRINT(TCU_O_FWD0, ulBase, print);
    REGH_PRINT(TCU_O_FIFOSR0, ulBase, print);
    REGH_PRINT(TCU_O_MODE3, ulBase, print);
    REGH_PRINT(TCU_O_FWD3, ulBase, print);
    REGH_PRINT(TCU_O_FIFOSR3, ulBase, print);
    REGH_PRINT(TCU_O_MODE4, ulBase, print);
    REGH_PRINT(TCU_O_FWD4, ulBase, print);
    REGH_PRINT(TCU_O_FIFOSR4, ulBase, print);
    REGH_PRINT(TCU_O_MODE5, ulBase, print);
    REGH_PRINT(TCU_O_FWD5, ulBase, print);
    REGH_PRINT(TCU_O_FIFOSR5, ulBase, print);
}
